In [1]:
import numpy as np
import pandas as pd 
from matplotlib import pyplot
import seaborn as sns

In [6]:
air_data

NameError: name 'air_data' is not defined

In [4]:
pd.read_csv('C:/Users/Justin/Downloads/pydata-book-2nd-edition/examples/ex1.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
du_me = pd.read_csv('C:/Users/Justin/Downloads/pydata-book-2nd-edition/examples/ex7.csv', names=('mike', 'chike', 'obodo'))

du_me

  mike chike obodo
0    a     b     c
1    1     2     3
2    1     2     3

In [24]:
pd.DataFrame((np.random.randn(5, 6)), index=['emeka', 'chike', 'adesuwa', 'oron', 'adefaka'])

                0         1         2         3         4         5
emeka    1.131720 -1.964706 -0.879595 -0.738130 -2.034649  1.043630
chike    0.078770 -1.277538 -0.201404 -1.916748 -0.593474  0.047542
adesuwa  1.101562 -0.465640  1.040843  0.368072  1.793308 -0.496982
oron     0.231306 -0.032075 -1.086801 -0.158431 -0.246691  1.258899
adefaka  0.462675  1.349640 -0.006093  1.607383 -1.535216  1.039469

In [25]:
range(len(20, 34, 56, 78, 96, 34)

SyntaxError: unexpected EOF while parsing (<ipython-input-25-4a8c4f176ead>, line 1)

In [30]:
list(range(2, 50, 4))

[2, 6, 10, 14, 18, 22, 26, 30, 34, 38, 42, 46]

In [ ]:
x = 568
total = 0
if